** TODO Jira planning                                             :MAAS_TEAM:
SCHEDULED: <2023-12-04 Mon +1d>
:LOGBOOK:
CLOCK: [2023-11-27 Mon 10:05]--[2023-11-27 Mon 12:00] =>  1:55
CLOCK: [2023-11-27 Mon 13:00]--[2023-11-27 Mon 17:30] =>  4:30
:END:

** TODO reporting clocked time last couple days                   :Canonical:
SCHEDULED: <2023-11-29 Wed>
:LOGBOOK:
CLOCK: [2023-11-29 Wed 14:35]--[2023-11-29 Wed 15:20] =>  0:45
:END:

** TODO motl: expert on devices: bios & pxe booting               :ta_cohort:
SCHEDULED: <2023-11-29 Wed +1d>
:LOGBOOK:
CLOCK: [2023-11-30 Thu 16:00]--[2023-11-30 Thu 18:07] =>  2:07
CLOCK: [2023-11-30 Thu 14:45]--[2023-11-30 Thu 16:00] =>  1:15
:END:

** TODO prepare recorded show and tell for thursday, while fresh  :Canonical:
SCHEDULED: <2023-12-01 Fri +1d>
:LOGBOOK:
CLOCK: [2023-12-01 Fri 10:35]--[2023-12-01 Fri 17:10] =>  6:35
:END:

** TODO General Planning & Time-Tracking Activities               :Canonical:
SCHEDULED: <2023-12-01 Fri +1d>
:PROPERTIES:
:LAST_REPEAT: [2023-11-30 Thu 14:45]
:END:
- State "DONE"       from "TODO"       [2023-11-30 Thu 14:45]
:LOGBOOK:
CLOCK: [2023-11-30 Thu 13:30]--[2023-11-30 Thu 14:45] =>  1:15
:END:


** TODO [#C] Jira planning and reporting                          :MAAS_TEAM:
SCHEDULED: <2023-11-28 Tue +1d>
:PROPERTIES:
:ID:       https://warthogs.atlassian.net/browse/MAASENG-1954
:TYPE:     ejira-issue
:Status:   In Progress
:Reporter: Bill Wear
:Assignee: Bill Wear
:Issuetype: Task
:Created:  2023-07-05 20:32:19
:Modified: 2023-11-28 20:01:42
:END:
:LOGBOOK:
CLOCK: [2023-12-02 Sat 15:28]--[2023-12-02 Sat 16:05] =>  0:37
CLOCK: [2023-11-29 Wed 15:20]--[2023-11-29 Wed 17:45] =>  2:25
CLOCK: [2023-11-29 Wed 12:30]--[2023-11-29 Wed 14:35] =>  2:05
:END:
** TODO [#C] Jira planning and reporting                          :MAAS_TEAM:
SCHEDULED: <2023-11-28 Tue +1d>
:PROPERTIES:
:ID:       https://warthogs.atlassian.net/browse/MAASENG-1954
:TYPE:     ejira-issue
:Status:   In Progress
:Reporter: Bill Wear
:Assignee: Bill Wear
:Issuetype: Task
:Created:  2023-07-05 20:32:19
:Modified: 2023-11-28 20:01:42
:END:
:LOGBOOK:
CLOCK: [2023-12-02 Sat 15:28]--[2023-12-02 Sat 16:05] =>  0:37
CLOCK: [2023-11-29 Wed 15:20]--[2023-11-29 Wed 17:45] =>  2:25
CLOCK: [2023-11-29 Wed 12:30]--[2023-11-29 Wed 14:35] =>  2:05
:END:
***** DONE meet with Eline to understand 3.5 logging architecture :MAAS_TEAM:
SCHEDULED: <2023-11-30 Thu 09:00-09:30>
:LOGBOOK:
CLOCK: [2023-11-30 Thu 09:00]--[2023-11-30 Thu 09:30] =>  0:30
:END:
***** DONE meet with jack and stamatis on their work              :MAAS_TEAM:
SCHEDULED: <2023-11-30 Thu 10:00-10:30>
:LOGBOOK:
CLOCK: [2023-11-30 Thu 10:00]--[2023-11-30 Thu 10:30] =>  0:30
:END:
** TODO managing ta_cohort Jira cards                             :ta_cohort:
SCHEDULED: <2023-11-30 Thu +1d>
:LOGBOOK:
CLOCK: [2023-11-30 Thu 13:05]--[2023-11-30 Thu 13:30] =>  0:25
:END:
** TODO ops manuals --> more holistic how-to docs                 :ta_cohort:
SCHEDULED: <2023-11-30 Thu +1d>
:LOGBOOK:
CLOCK: [2023-11-30 Thu 11:15]--[2023-11-30 Thu 12:05] =>  0:50
:END:
